10/data/attachments/f7a4c9c0b97dc13b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6a098ebe-a316-49a3-a6fa-8377ab78b4e0</nif:username>
            <nif:friendToBeAdded>Shannon_loss_Friend_77846_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>